"""Какие комментарии следует писать?
Главная задача комментария — объяснить, что должен делать ваш код и как он рабо
тает. В разгаре работы над проектом вы понимаете, как работают все его компонен
ты. Но если вернуться к проекту спустя некоторое время, скорее всего, некоторые
подробности будут забыты. Конечно, всегда можно изучить код и разобраться в том,
как должны работать его части, но хорошие комментарии с доступным изложением
общих принципов работы кода сэкономят немало времени."""

# Say hello to everyone
print("Hello Python people")


