"""6.7. Люди: начните с программы, написанной для упражнения 6.1 (с. 113). Создайте два но-
вых словаря, представляющих разных людей, и сохраните все три словаря в списке с име-
нем people. Переберите элементы списка людей. В процессе перебора выведите всю имею-
щуюся информацию о каждом человеке."""

person_1 = {
    "first_name": "Johnny",
    "last_name": "Depp",
    "age": 63,
    "city": "Owenborough",
}

person_2 = {
    "first_name": "Johnny",
    "last_name": "Depp",
    "age": 63,
    "city": "Owenborough",
}