"""Опытные программисты Python рекомендуют избегать лишних сложностей и по
возможности выбирать простые решения там, где это возможно. Философия со
общества Python выражена в очерке Тима Питерса «The Zen of Python». Чтобы
просмотреть этот краткий набор принципов написания хорошего кода Python, до
статочно ввести команду import this в интерпретаторе. Я не стану воспроизводить
все принципы, но приведу несколько строк, чтобы вы поняли, почему они важны
для вас как для начинающего программиста Python.
"""

import this
The Zen of Python, by Tim Peters
Красивое лучше, чем уродливое.

"""Если у вас есть выбор между простым и сложным решением и оба работают, ис
пользуйте простое решение. Код будет проще в сопровождении, а у вас и других 
разработчиков будет меньше проблем с обновлением этого кода в будущем.
"""

Сложное лучше, чем запутанное.

"""Реальность создает свои сложности; иногда простое решение задачи невозможно. 
В таком случае используйте самое простое решение, которое работает.
"""

Удобочитаемость имеет значение.


"""Даже если ваш код сложен, постарайтесь сделать так, чтобы он нормально читался. 
Работая над проектом, требующим написания сложного кода, постарайтесь напи
сать содержательные комментарии для этого кода.
"""

Должен существовать один — и желательно только один — очевидный способ сделать это.


"""Если предложить двум программистам Python решить одну и ту же задачу, они
должны выработать похожие решения. Это не значит, что в программировании
нет места для творчества. Наоборот! Но большая часть работы программиста за
ключается в применении небольших стандартных решений для простых ситуаций
в контексте большого, более творческого проекта. Внутренняя организация ваших
программ должна выглядеть логично с точки зрения других программистов Python.
"""

Сейчас лучше, чем никогда.

"""Вы можете потратить весь остаток жизни на изучение всех тонкостей Python
и программирования в целом, но в таком случае вы никогда не закончите ни
одного проекта. Не пытайтесь написать идеальный код; напишите код, который
работает, а потом решите, стоит ли доработать его для текущего проекта или
перейти на что-то другое.
"""

"""The Zen of Python, by Tim Peters
Дзен Python, автор — Тим Петерс

Beautiful is better than ugly.
Красивое лучше, чем уродливое.

Explicit is better than implicit.
Явное лучше, чем неявное.

Simple is better than complex.
Простое лучше, чем сложное.

Complex is better than complicated.
Сложное лучше, чем запутанное.

Flat is better than nested.
Плоское лучше, чем вложенное.

Sparse is better than dense.
Разреженное лучше, чем плотное.

Readability counts.
Читаемость имеет значение.

Special cases aren't special enough to break the rules.
Особые случаи не настолько особые, чтобы нарушать правила.

Although practicality beats purity.
Хотя практичность важнее идеальной чистоты.

Errors should never pass silently.
Ошибки никогда не должны проходить незаметно.

Unless explicitly silenced.
Если только они не были явно подавлены.

In the face of ambiguity, refuse the temptation to guess.
При неоднозначности откажись от соблазна угадывать.

There should be one-- and preferably only one --obvious way to do it.
Должен существовать один — и желательно только один — очевидный способ сделать это.

Although that way may not be obvious at first unless you're Dutch.
Хотя этот способ может быть неочевиден с первого взгляда, если ты не голландец.

Now is better than never.
Сейчас лучше, чем никогда.

Although never is often better than right now.
Хотя никогда часто лучше, чем прямо сейчас.

If the implementation is hard to explain, it's a bad idea.
Если реализацию трудно объяснить, это плохая идея.

If the implementation is easy to explain, it may be a good idea.
Если реализацию легко объяснить, это может быть хорошая идея.

Namespaces are one honking great idea -- let's do more of those!
Пространства имён — это чертовски отличная идея, давайте использовать их больше!"""


