"""5.10. Проверка имен пользователей: выполните следующие действия для создания про-
граммы, моделирующей проверку уникальности имен пользователей.
• Создайте список current_users, содержащий пять и более имен пользователей.
• Создайте другой список, new_users, содержащий пять имен пользователей. Убеди-
тесь в том, что одно или два новых имени также присутствуют в списке current_
users.
• Переберите список new_users и для каждого имени в этом списке проверьте, было ли
оно использовано ранее. Если имя уже использовалось, выведите сообщение о том,
что пользователь должен выбрать новое имя. Если имя не использовалось, выведите
сообщение о его доступности.
• Проследите за тем, чтобы сравнение выполнялось без учета регистра символов.
Если имя 'John' уже используется, в регистрации имени 'JOHN' следует отказать.
(Для этого необходимо создать копию current_users, содержащую версию всех су-
ществующих имен пользователей в нижнем регистре.)"""

current_users = ["Ramazan", "Anonymouse", "Diller", "Killer3000", "Mac Trahek"]
new_users = ["Anonymouse", "Samurai", "Einstein", "Killer3000", "Uzbek", "Sila"]

current_user_lower = [user.lower() for user in current_users]

for new_user in new_users:
    if new_user.lower() in current_user_lower:
        print(f"Имя '{new_user}' уже занято. Пожалуйста, выберите другое имя!")
    else:
        print(f"Имя '{new_user}' доступен для регистрации.")
